#Generated by Fabric Compiler ( version 2020.3 <build 62942> ) at Mon May 29 17:59:07 2023

add_design "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/source/top_basketball.v"
add_design "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/source/fenpin.v"
add_design "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/source/counter.v"
add_design "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/shuxian.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
add_design "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/tb_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tb_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/tb_top.v"
add_simulation "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/source/tb_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/counetr.v"
remove_simulation -force "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/counetr.v"
add_simulation "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/tb_counter.v"
add_simulation "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/tb_fenpin.v"
add_design "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/fenpin_4Hz.v"
remove_simulation -force "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/tb_fenpin.v"
add_simulation "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/tb_fenpin_4Hz.v"
add_simulation "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/tb_shuxian.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/guanjiao.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint -force -logic -fdc "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/guanjiao.fdc"
add_constraint "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/guanjiao.fdc"
remove_constraint -force -logic -fdc "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/guanjiao.fdc"
add_constraint "C:/Users/lenovo/Documents/Pango_Design_Suite_Projects/project_shudian_wangjie/source/guanjiao_yueshu.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top_basketball
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
